       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX02.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 04/03/2022.
       DATE-COMPILED. 04/03/2022.
        
       ENVIRONMENT DIVISION.
       
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. BRUNO-NOTEBOOK.
       OBJECT-COMPUTER. BRUNO-NOTEBOOK.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       
       FILE-CONTROL.

           SELECT CADALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
    
           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD CADALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".
      
       01 REG-ENT.
           02 NUMERO-ENT PIC 9(05).
           02 NOME-ENT PIC X(20).
           02 SEXO-ENT PIC X(01).
           02 DATA-NASCIMENTO-ENT.
              03 DD PIC 9(02).
              03 MM PIC 9(02).
              03 AA PIC 9(04).

       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".
       
       01 REG-SAI.
           02 NUMERO-SAI PIC 9(05).
           02 NOME-SAI PIC X(20).
           02 DATA-NASCIMENTO-SAI.
              03 DD PIC 9(02).
              03 MM PIC 9(02).
              03 AA PIC 9(04).
            
       WORKING-STORAGE SECTION.

       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       
           PERFORM INICIO.
	       PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
	       PERFORM TERMINO.
	    
           STOP RUN.

       INICIO.
    
           OPEN INPUT CADALU
           OUTPUT CADATU.
           PERFORM LEITURA.      

       LEITURA.
    
           READ CADALU
           AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
    
	       PERFORM GRAVACAO.
	       PERFORM LEITURA.
    
       GRAVACAO.
    
           MOVE NUMERO-ENT TO NUMERO-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE DATA-NASCIMENTO-ENT TO DATA-NASCIMENTO-SAI.
           WRITE REG-SAI.
    
       TERMINO.

           CLOSE CADALU CADATU.