       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX06.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 07/03/2022.
       DATE-COMPILED. 07/03/2022.
        
       ENVIRONMENT DIVISION.
       
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. BRUNO-NOTEBOOK.
       OBJECT-COMPUTER. BRUNO-NOTEBOOK.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       
       FILE-CONTROL.

           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
    
           SELECT CADSAI ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
      
       01 REG-ENT.
           02 MATRICULA-ENT PIC 9(05).
           02 NOME-ENT PIC X(30).
           02 SALARIOBRUTO-ENT PIC 9(05).

       FD CADSAI
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADSAI.DAT".
       
       01 REG-SAI.
           02 MATRICULA-SAI PIC 9(05).
           02 NOME-SAI PIC X(30).
           02 SALARIOBRUTO-SAI PIC 9(05).
            
       WORKING-STORAGE SECTION.

       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       
           PERFORM INICIO.
	       PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
	       PERFORM TERMINO.
	    
           STOP RUN.

       INICIO.
    
           OPEN INPUT CADENT
                OUTPUT CADSAI.
           PERFORM LEITURA.      

       LEITURA.
    
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
    
	       PERFORM CALCULO.
	       PERFORM LEITURA.

       CALCULO.
           IF SALARIOBRUTO-ENT IS GREATER THAN 3000 
              PERFORM GRAVACAO.
    
       GRAVACAO.
           
           MOVE MATRICULA-ENT TO MATRICULA-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE SALARIOBRUTO-ENT TO SALARIOBRUTO-SAI.
           WRITE REG-SAI.
    
       TERMINO.

           CLOSE CADENT CADSAI.