       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX07.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 11/03/2022.
       DATE-COMPILED. 11/03/2022.
        
       ENVIRONMENT DIVISION.
       
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. BRUNO-NOTEBOOK.
       OBJECT-COMPUTER. BRUNO-NOTEBOOK.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       
       FILE-CONTROL.

           SELECT CADALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
    
           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD CADALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".
      
       01 REG-ENT.
           02 NUMERO-ENT PIC 9(05).
           02 NOME-ENT PIC X(20).
           02 NOTA1 PIC 9(02)V99.
           02 NOTA2 PIC 9(02)V99.
           02 NOTA3 PIC 9(02)V99.
           02 NOTA4 PIC 9(02)V99.
           02 SEXO-ENT PIC X(01).

       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".
       
       01 REG-SAI.
           02 NUMERO-SAI PIC 9(05).
           02 NOME-SAI PIC X(20).
           02 MEDIA PIC 9(02)V99.
           02 SEXO-SAI PIC X(01).
            
       WORKING-STORAGE SECTION.

       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       
           PERFORM INICIO.
	       PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
	       PERFORM TERMINO.
	    
           STOP RUN.

       INICIO.
    
           OPEN INPUT CADALU
                OUTPUT CADATU.
           PERFORM LEITURA.      

       LEITURA.
    
           READ CADALU AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
    
	       PERFORM CALCULO.
	       PERFORM LEITURA.

       CALCULO.
           IF SEXO-ENT EQUAL "F"
              COMPUTE MEDIA = (NOTA1+NOTA2+NOTA3+NOTA4)/4
              PERFORM GRAVACAO.
    
       GRAVACAO.
           
           MOVE NUMERO-ENT TO NUMERO-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE SEXO-ENT TO SEXO-SAI.
           WRITE REG-SAI.
    
       TERMINO.

           CLOSE CADALU CADATU.