       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX04.
       AUTHOR. BRUNO CARVALHO.
       DATE-WRITTEN. 22/04/2023.
       DATE-COMPILED. 22/04/2023.
       INSTALLATION. BRUNO-PC.
       SECURITY. ESSE PROGRAMA SO PODE SER ALTERADO PELO AUTOR.

       ENVIRONMENT DIVISION. 

       CONFIGURATION SECTION. 
       SOURCE-COMPUTER. BRUNO-PC.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT CADESTOQ ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL. 

           SELECT RELESTOQ ASSIGN TO DISK. 

       DATA DIVISION. 

       FILE SECTION.

       FD  CADESTOQ
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADESTOQ.DAT".
       01  CADESTOQ1.
           02 CODIGO-ESTOQ            PIC 9(05).
           02 NOME-ESTOQ              PIC X(15).
           02 QTDE-ESTOQ              PIC 9(05).
           02 PRECO-UNIT-ESTOQ        PIC 9(06)V9(02).

       FD  RELESTOQ
           LABEL RECORD IS OMITTED
           VALUE OF FILE-ID IS "RELESTOQ.TXT".
       01  REL-ITEM     PIC X(72).
       01  REL-TOT      PIC X(72).
       
       WORKING-STORAGE SECTION. 
       77  FIM-ARQ        PIC X(03) VALUE "NAO".
       77  CT-LIN         PIC 9(02) VALUE 25.
       77  CT-PAG         PIC 9(03) VALUE ZEROES.

       77  ITEM-TOT-TEMP  PIC 9(08)V9(02) VALUE ZEROES.                     

       77  QTD-PROD-TEMP  PIC 9(07) VALUE ZEROES.
       77  PRE-TOT-TEMP   PIC 9(08)V9(02) VALUE ZEROES.
       77  PRE-MED-TEMP   PIC 9(06)V9(02) VALUE ZEROES.

       01  CAB-01.
           02 FILLER  PIC X(06) VALUE "DATA: ".
           02 DIA     PIC 9(02) VALUE 22.
           02 FILLER  PIC X(01) VALUE "/".
           02 MES     PIC 9(02) VALUE 04.
           02 FILLER  PIC X(01) VALUE "/".
           02 ANO     PIC 9(04) VALUE 2023.
           02 FILLER  PIC X(03) VALUE SPACES.
           02 FILLER  PIC X(22) VALUE "RELATORIO DE MATERIAL ".
           02 FILLER  PIC X(10) VALUE "EM ESTOQUE".
           02 FILLER  PIC X(13) VALUE SPACES.
           02 FILLER  PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC 9(03).
         
       01  CAB-02.
           02 FILLER PIC X(06) VALUE "CODIGO".
           02 FILLER PIC X(04) VALUE SPACES.
           02 FILLER PIC X(04) VALUE "NOME".
           02 FILLER PIC X(09) VALUE SPACES. 
           02 FILLER PIC X(07) VALUE "QTDE DO".
           02 FILLER PIC X(02) VALUE SPACES. 
           02 FILLER PIC X(15) VALUE "CUSTO-UNITARIO".
           02 FILLER PIC X(02) VALUE SPACES.
           02 FILLER PIC X(15) VALUE "CUSTO-TOTAL".

       01  CAB-02A.
           02 FILLER PIC X(23) VALUE SPACES.
           02 FILLER PIC X(07) VALUE "ESTOQUE".
           02 FILLER PIC X(34) VALUE SPACES. 

       01  DETALHE.
           02 CODIGO    PIC 9(05).
           02 FILLER    PIC X(02) VALUE SPACES.
           02 NOME      PIC X(15).
           02 QTD-ITEM  PIC Z99.999.
           02 FILLER    PIC X(04) VALUE SPACES. 
           02 CUSTO-UNI PIC Z999.999,99.
           02 FILLER    PIC X(04) VALUE SPACES. 
           02 CUSTO-TOT PIC Z9.999.999,99.

       01  CAB-03.
           02 FILLER PIC X(16) VALUE "QUANTIDADE TOTAL".
           02 FILLER PIC X(12) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "PRECO MEDIO".
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "PRECO TOTAL". 
           
       01  TOTAL-ESTOQS.
           02 FILLER         PIC X(03) VALUE SPACES.
           02 QTD-ESTOQS     PIC Z9.999.999 VALUE ZEROES.
           02 FILLER         PIC X(14) VALUE SPACES.
           02 PRE-MED-ESTOQS PIC Z999.999,99 VALUE ZEROES.
           02 FILLER         PIC X(05) VALUE SPACES.
           02 PRE-TOT-ESTOQS PIC Z99.999.999,99 VALUE ZEROES.
             
       PROCEDURE DIVISION. 

       MAIN.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT  CADESTOQ
                OUTPUT RELESTOQ.
           PERFORM LEITURA.

       LEITURA.
           READ CADESTOQ AT END MOVE "SIM" TO FIM-ARQ.

       ATUALIZA-PAG.
           ADD 1         TO CT-PAG.
           MOVE CT-PAG   TO VAR-PAG.
       
       CABECALHO-ITEM.
           PERFORM ATUALIZA-PAG.
           MOVE SPACES   TO REL-ITEM.

           IF CT-PAG = 1
               WRITE REL-ITEM FROM CAB-01
           ELSE WRITE REL-ITEM FROM CAB-01 AFTER ADVANCING 4 LINE.
           
           WRITE REL-ITEM FROM CAB-02 AFTER ADVANCING 2 LINE.
           WRITE REL-ITEM FROM CAB-02A AFTER ADVANCING 1 LINE.

           MOVE ZEROES TO CT-LIN.
           
       IMPRESSAO.
           IF CT-LIN EQUAL 25
               PERFORM CABECALHO-ITEM.

           MOVE CODIGO-ESTOQ     TO CODIGO.
           MOVE NOME-ESTOQ       TO NOME.
           MOVE QTDE-ESTOQ       TO QTD-ITEM.
           MOVE PRECO-UNIT-ESTOQ TO CUSTO-UNI.
           
           MULTIPLY PRECO-UNIT-ESTOQ BY QTDE-ESTOQ GIVING ITEM-TOT-TEMP.
           MOVE ITEM-TOT-TEMP TO CUSTO-TOT.

           ADD 1                 TO CT-LIN.
           ADD QTDE-ESTOQ        TO QTD-PROD-TEMP.
           ADD ITEM-TOT-TEMP     TO PRE-TOT-TEMP.

           WRITE REL-ITEM  FROM DETALHE AFTER ADVANCING 1 LINE.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA.

       IMPRESSAO-FINAL.
           PERFORM ATUALIZA-PAG.
           
           MOVE QTD-PROD-TEMP TO QTD-ESTOQS.

           DIVIDE PRE-TOT-TEMP BY QTD-PROD-TEMP
              GIVING PRE-MED-TEMP.
           MOVE PRE-MED-TEMP TO PRE-MED-ESTOQS.

           MOVE PRE-TOT-TEMP TO PRE-TOT-ESTOQS.
           
           WRITE REL-TOT FROM CAB-01 AFTER ADVANCING 4 LINE.
           WRITE REL-TOT FROM CAB-03 AFTER ADVANCING 3 LINE.
           WRITE REL-TOT FROM TOTAL-ESTOQS AFTER ADVANCING 2 LINE.
           
       FIM.
           PERFORM IMPRESSAO-FINAL.
           CLOSE CADESTOQ RELESTOQ.