       IDENTIFICATION DIVISION.
       PROGRAM-ID.  EM01-EX02.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO. 
       INSTALLATION.  FATEC-SP.
       DATE-WRITTEN.  18/AUG/2023. 
       DATE-COMPILED. 18/AUG/2023. 
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. FATEC-SP.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       DATA DIVISION. 
       WORKING-STORAGE SECTION.

       77 BASEMAIOR PIC 9(003) VALUE ZEROS.
       77 BASEMENOR PIC 9(003) VALUE ZEROS. 
       77 ALTURA PIC 9(003) VALUE ZEROS.
       77 AREA-RESULT PIC 9(003) VALUE ZEROS.

       PROCEDURE DIVISION.
      
       INICIO.

           DISPLAY ERASE.
           DISPLAY "CALCULO DE AREA (TRAPEZIO)" AT 0521.
           DISPLAY "BASE-MAIOR: " AT 1010.
           DISPLAY "BASE-MENOR: " AT 1210.
           DISPLAY "ALTURA: "  AT 1410.
              
           ACCEPT BASEMAIOR AT 1022.
           ACCEPT BASEMENOR AT 1222.
           ACCEPT ALTURA AT 1422.

           COMPUTE AREA-RESULT =((BASEMAIOR+BASEMENOR)*ALTURA)/2.
           DISPLAY "AREA: " AT 1610 AREA-RESULT.
           DISPLAY " " AT 1810. 

       STOP RUN.




