       IDENTIFICATION DIVISION.
       PROGRAM-ID.      PROG02.
       AUTHOR.          BRUNO CARVALHO.
       INSTALLATION.    FATEC-SP.
       DATA-WRITTEN.    10/04/2021.
       DATA-COMPILED.   10/04/2021.
       SECURITY.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
            
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 BASE     PIC 9(003)V9 VALUE ZEROS.
       77 AAREA     PIC 9(006)V9 VALUE ZEROS.

       SCREEN SECTION.
       01 TELA.

           02 BLANK SCREEN.
           02 LINE 04 COL 21 VALUE "CALCULE A AREA DO QUADRADO".
           02 LINE 10 COL 21 VALUE "ENTRE COM O VALOR DO LADO".
           02 LINE 12 COL 21 VALUE "O CALCULO DA AREA E:".

       PROCEDURE DIVISION.

       INICIO.
           DISPLAY TELA.

        DIGITACAO.
           ACCEPT BASE AT 1049.

        CALCULO.
           MULTIPLY BASE BY BASE GIVING AAREA.
        
        EXIBE-RESULTADO.
           DISPLAY AAREA AT 1245.
           DISPLAY "FINAL DO PROGRAMA TESTE SCREEN " AT 2031.
           STOP RUN.