       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX03.
       AUTHOR. BRUNO CARVALHO.
       DATE-WRITTEN. 22/04/2023.
       DATE-COMPILED. 22/04/2023.
       INSTALLATION. BRUNO-PC.
       SECURITY. ESSE PROGRAMA SO PODE SER ALTERADO PELO AUTOR.

       ENVIRONMENT DIVISION. 

       CONFIGURATION SECTION. 
       SOURCE-COMPUTER. BRUNO-PC.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL. 

           SELECT RELSAI ASSIGN TO DISK. 

       DATA DIVISION. 

       FILE SECTION.

       FD  CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01  CADENT1.
           02 CODIGO-CLIENTE      PIC 9(07).
           02 NOME-CLIENTE        PIC X(30).
           02 SALARIO-CLIENTE     PIC 9(05)V9(02).
           02 SEXO                PIC X(01).

       FD  RELSAI
           LABEL RECORD IS OMITTED
           VALUE OF FILE-ID IS "RELSAI.TXT".
       01  REL-ITEM     PIC X(72).
       01  REL-CLI-IMP  PIC X(72).
       01  REL-SAL      PIC X(72).

       WORKING-STORAGE SECTION. 
       77  FIM-ARQ       PIC X(03) VALUE "NAO".
       77  CT-LIN        PIC 9(02) VALUE 20.
       77  CT-PAG        PIC 9(03) VALUE ZEROES.
       77  QTD-CLI-TEMP  PIC 9(05) VALUE ZEROES.
       77  SUM-SAL-TEMP  PIC 9(09)V9(02) VALUE ZEROES.

       01  CAB-01.
           02 FILLER  PIC X(54) VALUE SPACES.
           02 FILLER  PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC 99(03).
           02 FILLER  PIC X(2) VALUE SPACES.

       01  CAB-02.
           02 FILLER  PIC X(12) VALUE SPACES.
           02 FILLER  PIC X(22) VALUE "LISTAGEM DOS CLIENTES ".
           02 FILLER  PIC X(16) VALUE "DO SEXO FEMININO".
           02 FILLER  PIC X(12) VALUE SPACES.

       01  CAB-03.
           02 FILLER PIC X(14) VALUE SPACES.
           02 FILLER PIC X(24) VALUE "COM SALARIOS SUPERIORES ".
           02 FILLER PIC X(10) VALUE "A 5.000,00".
           02 FILLER PIC X(24) VALUE SPACES.

       01  CAB-04.
           02 FILLER PIC X(04) VALUE SPACES.
           02 FILLER PIC X(08) VALUE " CODIGO ".
           02 FILLER PIC X(05) VALUE SPACES.
           02 FILLER PIC X(08) VALUE "  NOME  ".
           02 FILLER PIC X(31) VALUE SPACES. 
           02 FILLER PIC X(07) VALUE "SALARIO".
           02 FILLER PIC X(13) VALUE SPACES.

       01  DETALHE.
           02 FILLER      PIC X(5) VALUE SPACES.
           02 CODIGO      PIC 9(07).
           02 FILLER      PIC X(05) VALUE SPACES.
           02 NOME        PIC X(30).
           02 FILLER      PIC X(08) VALUE SPACES.
           02 SALARIO     PIC Z99.999,99.

       01  TOTAL-CLIENTES.
           02 FILLER   PIC X(29) VALUE "Total de Clientes impressos: ".
           02 FILLER       PIC X(08) VALUE SPACES.
           02 QTD-CLIENTES PIC Z99.999 VALUE ZEROES.

       01  TOTAL-SALARIO.
           02 FILLER      PIC X(18) VALUE "Total de Salario: ".
           02 FILLER      PIC X(11) VALUE SPACES.
           02 SUM-SALARIO PIC Z999.999.999,99 VALUE ZEROES.
             
       PROCEDURE DIVISION. 

       MAIN.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT  CADENT
                OUTPUT RELSAI.
           PERFORM LEITURA.

       LEITURA.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.
       
       CABECALHO.
           ADD 1         TO CT-PAG.
           MOVE CT-PAG   TO VAR-PAG.
           MOVE SPACES   TO REL-ITEM.

           IF CT-PAG = 1
               WRITE REL-ITEM FROM CAB-01
           ELSE WRITE REL-ITEM FROM CAB-01 AFTER ADVANCING 4 LINE.
           WRITE REL-ITEM FROM CAB-02 AFTER ADVANCING 1 LINE.
           WRITE REL-ITEM FROM CAB-03 AFTER ADVANCING 1 LINE.
           WRITE REL-ITEM FROM CAB-04 AFTER ADVANCING 3 LINE.

           MOVE ZEROES   TO CT-LIN.

       IMPRESSAO.
           IF CT-LIN EQUAL 20
               PERFORM CABECALHO.

           MOVE CODIGO-CLIENTE   TO CODIGO.
           MOVE NOME-CLIENTE     TO NOME.
           MOVE SALARIO-CLIENTE  TO SALARIO.
           ADD 1                 TO CT-LIN.

           IF CT-LIN EQUAL 1
               WRITE REL-ITEM  FROM DETALHE AFTER ADVANCING 2 LINE
           ELSE WRITE REL-ITEM FROM DETALHE AFTER ADVANCING 1 LINE.

       PRINCIPAL.
           IF SEXO = 'F' AND SALARIO-CLIENTE > 5000
              ADD 1 TO QTD-CLI-TEMP
              ADD SALARIO-CLIENTE TO SUM-SAL-TEMP
              PERFORM IMPRESSAO.
           PERFORM LEITURA.

       IMPRESSAO-FINAL.
           MOVE QTD-CLI-TEMP TO QTD-CLIENTES.
           MOVE SUM-SAL-TEMP TO SUM-SALARIO.
           WRITE REL-CLI-IMP FROM TOTAL-CLIENTES AFTER ADVANCING 4 LINE.
           WRITE REL-SAL     FROM TOTAL-SALARIO AFTER ADVANCING 1 LINE.
           
       FIM.
           PERFORM IMPRESSAO-FINAL.
           CLOSE CADENT RELSAI.