       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX02.
       AUTHOR. BRUNO CARVALHO.
       DATE-WRITTEN.  19/06/2023.
       DATE-COMPILED. 19/06/2023.
       SECURITY. APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS. LER ARQUIVO CADANT E ARQMOV E GERAR CADATU E RELOCORR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. BRUNO-PC.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADANT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQMOV ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT RELOCORR ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.

       FD CADANT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADANT.DAT".
       01 REG-ANT.
           03 CC-ANT    PIC 9(03).
           03 TIPO-ANT  PIC X(01).
           03 ENDER-ANT PIC X(50).

       FD ARQMOV
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "ARQMOV.DAT".
       01 REG-MOV.
           02 COD-MVTO   PIC 9(03).
           02 TIPO-MVTO  PIC X(01).
           02 ENDER-MVTO PIC X(50).

       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".
       01 REG-ATU.
           03 CC-ATU    PIC 9(03).
           03 TIPO-ATU  PIC X(01).
           03 ENDER-ATU PIC X(50).

       FD RELOCORR
           LABEL RECORD IS OMITTED
           VALUE OF FILE-ID IS "RELOCORR.TXT".
       01 REG-RELOCORR.
           04 MENSAGEM-OCORRENCIA PIC X(80).

       WORKING-STORAGE SECTION.
           77 WS-COD-CADANT    PIC 9(03).
           77 WS-COD-ARQMOV    PIC 9(03).
           77 WS-PAGINA        PIC 9(02) VALUE ZEROES.
           77 WS-LINHAS-PAGINA PIC 9(02) VALUE 40.
           77 WS-LINHA-DETALHE PIC X(80).


       PROCEDURE DIVISION.
       PGM-EX02.
           PERFORM INICIO.
           PERFORM PRINCIPAL
               UNTIL CC-ANT = HIGH-VALUES
                 OR COD-MVTO = HIGH-VALUES.
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT  CADANT ARQMOV
                OUTPUT CADATU RELOCORR.

       PRINCIPAL.
           READ CADANT
               AT END MOVE HIGH-VALUES TO CC-ANT.
           
           READ ARQMOV
                AT END MOVE HIGH-VALUES TO COD-MVTO.
           
           IF CC-ANT EQUAL TO COD-MVTO THEN
               PERFORM PROCESSAR-REGISTRO
           ELSE IF CC-ANT LESS THAN COD-MVTO THEN
               PERFORM PROCESSAR-ANT
           ELSE
               PERFORM PROCESSAR-MVTO.
           
           IF WS-PAGINA EQUAL TO WS-LINHAS-PAGINA THEN
               PERFORM IMPRIMIR-PAGINA.

           GO TO PRINCIPAL.

       PROCESSAR-ANT.
           MOVE TIPO-ANT TO TIPO-ATU.
           MOVE ENDER-ANT TO ENDER-ATU.
           WRITE REG-ATU.

           MOVE "REGISTRO INCLUIDO" TO MENSAGEM-OCORRENCIA.
           PERFORM ESCREVER-RELOCORR.

           READ CADANT AT END MOVE HIGH-VALUES TO CC-ANT.

       PROCESSAR-MVTO.
           MOVE TIPO-MVTO TO TIPO-ATU.
           MOVE ENDER-MVTO TO ENDER-ATU.

           IF TIPO-MVTO EQUAL "I" THEN
               MOVE "REGISTRO SUBSTITUTO" TO MENSAGEM-OCORRENCIA
           ELSE IF TIPO-MVTO EQUAL "A" THEN 
               MOVE "REGISTRO ALTERADO" TO MENSAGEM-OCORRENCIA
           ELSE IF TIPO-MVTO EQUAL "E" THEN 
               MOVE "REGISTRO EXCLUIDO" TO MENSAGEM-OCORRENCIA.

       PROCESSAR-REGISTRO.
           MOVE TIPO-ANT TO TIPO-ATU.
           MOVE ENDER-ANT TO ENDER-ATU.
           WRITE REG-ATU.

           MOVE "REGISTRO SUBSTITUIDO" TO MENSAGEM-OCORRENCIA.
           PERFORM ESCREVER-RELOCORR.

           READ CADANT AT END MOVE HIGH-VALUES TO CC-ANT.
           READ ARQMOV AT END MOVE HIGH-VALUES TO COD-MVTO.

       ESCREVER-RELOCORR.
           WRITE REG-RELOCORR AT END MOVE HIGH-VALUES TO CC-ANT.
           ADD 1 TO WS-PAGINA.

       IMPRIMIR-PAGINA.
           MOVE ZEROES TO WS-PAGINA.
           PERFORM IMPRIMIR-DETALHE.

       IMPRIMIR-DETALHE.
           MOVE CC-ATU TO WS-COD-CADANT.
           MOVE COD-MVTO TO WS-COD-ARQMOV.
           MOVE WS-COD-CADANT TO WS-LINHA-DETALHE(1:4).
           MOVE TIPO-ATU TO WS-LINHA-DETALHE(6:1).
           MOVE ENDER-ATU TO WS-LINHA-DETALHE(8:50).
           MOVE WS-COD-ARQMOV TO WS-LINHA-DETALHE(59:4).
           MOVE TIPO-MVTO TO WS-LINHA-DETALHE(61:1).
           MOVE ENDER-MVTO TO WS-LINHA-DETALHE(63:50).
           WRITE WS-LINHA-DETALHE.

       FIM.
           CLOSE CADANT ARQMOV CADATU RELOCORR.
           
