       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX02A.
       AUTHOR. BRUNO CARVALHO.
       INSTALLATION.  BRUNO-PC.
       DATE-WRITTEN.  19/06/2023.
       DATE-COMPILED. 19/06/2023.
       SECURITY. APENAS O AUTOR PODE MODIFICA-LO.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. BRUNO-PC.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADANT ASSIGN TO "CADANT.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       
           SELECT ARQMOV ASSIGN TO "ARQMOV.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       
           SELECT CADATU ASSIGN TO "CADATU.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       
           SELECT RELOCORR ASSIGN TO "RELOCORR.TXT".
       
       DATA DIVISION.
       FILE SECTION.
       
       FD CADANT
           LABEL RECORD ARE STANDARD.
       01 CADANT-REC.
           02 CADANT-COD PIC 9(04).
           02 CADANT-NOME PIC X(30).
       
       FD ARQMOV
           LABEL RECORD ARE STANDARD.
       01 ARQMOV-REC.
           02 ARQMOV-COD PIC 9(04).
           02 ARQMOV-NOME PIC X(30).
       
       FD CADATU
           LABEL RECORD ARE STANDARD.
       01 CADATU-REC.
           02 CADATU-COD PIC 9(04).
           02 CADATU-NOME PIC X(30).
       
       FD RELOCORR
           LABEL RECORD IS OMITTED.
       01 RELOCORR-REC.
           02 RELOCORR-MENSAGEM PIC X(80).
       
       WORKING-STORAGE SECTION.
       01 WS-COD-CADANT PIC 9(04).
       01 WS-COD-ARQMOV PIC 9(04).
       01 CADANT-EOF PIC X(01) VALUE 'N'.
       01 ARQMOV-EOF PIC X(01) VALUE 'N'.
       
       
       PROCEDURE DIVISION.
       PGM-BALANCE-LINE.
           PERFORM INICIO.
           PERFORM BALANCE-LINE.
           PERFORM FIM.
           STOP RUN.
       
       INICIO.
           OPEN INPUT CADANT, ARQMOV
               OUTPUT CADATU, RELOCORR.
       
       BALANCE-LINE.
           PERFORM LER-CADANT
           PERFORM LER-ARQMOV
           UNTIL CADANT-EOF EQUAL 'Y' OR ARQMOV-EOF EQUAL 'Y'.
       
       LER-CADANT.
           READ CADANT
               AT END MOVE 'Y' TO CADANT-EOF.
       
       LER-ARQMOV.
           READ ARQMOV
               AT END MOVE 'Y' TO ARQMOV-EOF.
       
           IF CADANT-EOF EQUAL 'N' AND ARQMOV-EOF EQUAL 'N'
               MOVE CADANT-COD TO WS-COD-CADANT
               MOVE ARQMOV-COD TO WS-COD-ARQMOV
               PERFORM VERIFICAR-CODIGOS.
       
       VERIFICAR-CODIGOS.
           IF WS-COD-CADANT EQUAL WS-COD-ARQMOV
               PERFORM GRAVAR-CADATU
               PERFORM LER-CADANT
               PERFORM LER-ARQMOV
           ELSE IF WS-COD-CADANT < WS-COD-ARQMOV
               PERFORM GRAVAR-CADATU
               PERFORM LER-CADANT
           ELSE
               PERFORM GRAVAR-CADATU
               PERFORM LER-ARQMOV.
       
       GRAVAR-CADATU.
           MOVE WS-COD-CADANT TO CADATU-COD
           MOVE CADANT-NOME TO CADATU-NOME
           WRITE CADATU-REC.
       
       VERIFICAR-CODIGO-EXTRA.
           IF CADANT-EOF = 'N'
               PERFORM GRAVAR-RELOCORR-CADANT
           IF ARQMOV-EOF = 'N'
               PERFORM GRAVAR-RELOCORR-ARQMOV.
       
       GRAVAR-RELOCORR-CADANT.
           MOVE "Ocorrência no CADANT: " TO RELOCORR-MENSAGEM
           MOVE WS-COD-CADANT TO RELOCORR-MENSAGEM(25:4)
           WRITE RELOCORR-REC.
       
       GRAVAR-RELOCORR-ARQMOV.
           MOVE "Ocorrência no ARQMOV: " TO RELOCORR-MENSAGEM
           MOVE WS-COD-ARQMOV TO RELOCORR-MENSAGEM(26:4)
           WRITE RELOCORR-REC.
       
       FIM.
           CLOSE CADANT, ARQMOV, CADATU, RELOCORR.
