       IDENTIFICATION DIVISION.
       PROGRAM-ID.  CALC-AREA-TRIANGULO.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO. 
       INSTALLATION.  FATEC-SP.
       DATE-WRITTEN.  18/AUG/2023. 
       DATE-COMPILED. 18/AUG/2023. 
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. FATEC-SP.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       DATA DIVISION. 
       WORKING-STORAGE SECTION.

       77 LARGURA PIC 9(003) VALUE ZEROS.
       77 ALTURA PIC 9(003) VALUE ZEROS.
       77 AREA-RESULT PIC 9(003) VALUE ZEROS.

       PROCEDURE DIVISION.
      
       INICIO.

           DISPLAY ERASE.
           DISPLAY "CALCULO DE AREA (RETANGULOS)" AT 0521.
           DISPLAY "LARGURA: " AT 1010.
           DISPLAY "ALTURA: "  AT 1210.
              
           ACCEPT LARGURA AT 1019.
           ACCEPT ALTURA AT 1219.

           COMPUTE AREA-RESULT = LARGURA * ALTURA.
           DISPLAY "AREA: " AT 1410 AREA-RESULT.
           DISPLAY " " AT 1510.

       STOP RUN.




