       IDENTIFICATION DIVISION.
       PROGRAM-ID.  EM01-EX04.
       AUTHOR. BRUNO RODRIGUES DE CARVALHO. 
       INSTALLATION.  FATEC-SP.
       DATE-WRITTEN.  15/SEP/2023. 
       DATE-COMPILED. 15/SEP/2023. 
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. FATEC-SP.
       OBJECT-COMPUTER. BRUNO-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       DATA DIVISION. 
       WORKING-STORAGE SECTION.

       77 CFAB PIC 9(6).
       77 PD   PIC 9(2) VALUE 28.
       77 IMP  PIC 9(2) VALUE 45.
       77 CFIN PIC Z.ZZZ.Z99,99.

       PROCEDURE DIVISION.
      
       INICIO.

           DISPLAY ERASE.
           DISPLAY "CALCULO CUSTO CARRO" AT 0520.
           DISPLAY "CUSTO DE FABRICA: " AT 1010.
              
           ACCEPT CFAB AT 1029.
           
           COMPUTE CFIN = ((PD/100)*CFAB)+((IMP/100)*CFAB)+CFAB.

           DISPLAY "CUSTO FINAL: " AT 1510 CFIN.

           DISPLAY " " AT 1910. 

       STOP RUN.




